Tekla Open API Reference for Tekla Structures 2025
AngleList.ToString Method
Overload List
Name | Description
ToString(IEnumerable<Angle>)
 Converts the given angles to a string in the current units
ToString(IEnumerable<Angle>, Angle.UnitType)
 Converts the given angles to a string in the given units
ToString(IEnumerable<Angle>, String, IFormatProvider)
 Converts the given angles to a string with the given parameters in the current unit
ToString(IEnumerable<Angle>, String, IFormatProvider, Angle.UnitType)
 Converts the given angles to a string with the given parameters in the current unit
Top
See Also
Reference
AngleList Class
Tekla.Structures.Datatype Namespace